In [0]:
from google.colab import drive
drive.mount('/gdrive')

In [0]:
import pandas as pd
import numpy as np

In [0]:
pandas_path = '/gdrive/My Drive/Colab Notebooks/db/{}'

## Formatos
---

In [0]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}

In [0]:
df = pd.DataFrame(dict_data)

### CSV

In [0]:
df.to_csv(pandas_path.format('test.csv'), index=False, sep='|')

In [66]:
pd.read_csv(pandas_path.format('test.csv'), sep='|')

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

### Excel

In [0]:
df.to_excel(pandas_path.format('test.xlsx'), index=False, sheet_name='sheet_1')

In [68]:
pd.read_excel(pandas_path.format('test.xlsx'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

### JSON

In [0]:
df.to_json(pandas_path.format('test.json'))

In [70]:
pd.read_json(pandas_path.format('test.json'))

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

### Pickle (binario comprimido)

In [0]:
df.to_pickle(pandas_path.format('test.pkl'))

In [72]:
pd.read_pickle(pandas_path.format('test.pkl'))

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

 ### Parquet

In [0]:
df.to_parquet(pandas_path.format('test.parquet'))

In [74]:
pd.read_parquet(pandas_path.format('test.parquet'))

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

### HDF

In [0]:
df.to_hdf(pandas_path.format('test.hdf'), key='data', format='table')

In [76]:
pd.read_hdf(pandas_path.format('test.hdf'))

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

### PostgreSQL

In [0]:
import psycopg2

In [0]:
postgres_connection = psycopg2.connect(
    host='127.0.0.1',
    port='5432',
    user='username',
    password='password',
    dbname='dbname'
)

In [0]:
sql_query = '''
SELECT * FROM table
'''

In [0]:
pd.read_sql(sql_query, postgres_connection)